In [1]:
import pandas as pd

In [2]:
data = [1,2,3,4,5,10]
data

[1, 2, 3, 4, 5, 10]

In [3]:
type(data)

list

In [4]:
s = pd.Series(data)
s

0     1
1     2
2     3
3     4
4     5
5    10
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [6]:
df = pd.DataFrame(s)
df

    0
0   1
1   2
2   3
3   4
4   5
5  10

In [7]:
df = pd.DataFrame(s, columns=['Numbers'])
df

   Numbers
0        1
1        2
2        3
3        4
4        5
5       10

In [8]:
data

[1, 2, 3, 4, 5, 10]

In [11]:
df1 = pd.DataFrame(data, columns=['Numbers2'])
df1

   Numbers2
0         1
1         2
2         3
3         4
4         5
5        10

In [12]:
s2 = df1['Numbers2']
s2

0     1
1     2
2     3
3     4
4     5
5    10
Name: Numbers2, dtype: int64

In [13]:
type(s2)

pandas.core.series.Series

In [16]:
data = [[1,2], [4,5], [7,8],[10,11]]
data

[[1, 2], [4, 5], [7, 8], [10, 11]]

In [20]:
df = pd.DataFrame(data, columns=['Numbers1', 'Numbers2'])
df

   Numbers1  Numbers2
0         1         2
1         4         5
2         7         8
3        10        11

In [21]:
s = df[['Numbers1', 'Numbers2']]
s

   Numbers1  Numbers2
0         1         2
1         4         5
2         7         8
3        10        11

In [22]:
# Dictionary to DataFrame and Series
data = {
    'Name' :['A', 'B', 'C', 'D'],
    'age' : [10, 20, 30, 40],
    'city' : ['Pune', 'Mumbai', 'Delhi', 'Chennai']
}
data

{'Name': ['A', 'B', 'C', 'D'],
 'age': [10, 20, 30, 40],
 'city': ['Pune', 'Mumbai', 'Delhi', 'Chennai']}

In [24]:
df = pd.DataFrame(data)
df

  Name  age     city
0    A   10     Pune
1    B   20   Mumbai
2    C   30    Delhi
3    D   40  Chennai

In [27]:
series = pd.Series(data['Name'])
series

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [29]:
series = pd.Series(data['Name'], name='Name')
series

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [30]:
df

  Name  age     city
0    A   10     Pune
1    B   20   Mumbai
2    C   30    Delhi
3    D   40  Chennai

In [34]:
age_series = df['age']
age_series

0    10
1    20
2    30
3    40
Name: age, dtype: int64

In [ ]:
# Set to DataFrame and Series